Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.MullionProfileContainsOpenLoop
The selected mullion profile contains an open profile loop and cannot be used. Valid profiles can only have closed profile loop(s).